{
  "_name_or_path": "xlm-roberta-base",
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-COL",
    "1": "B-CWA",
    "2": "B-Degree",
    "3": "B-Des",
    "4": "B-Email",
    "5": "B-GYear",
    "6": "B-LOC",
    "7": "B-Name",
    "8": "B-Skills",
    "9": "B-YOE",
    "10": "I-COL",
    "11": "I-CWA",
    "12": "I-Degree",
    "13": "I-Des",
    "14": "I-Email",
    "15": "I-GYear",
    "16": "I-LOC",
    "17": "I-Name",
    "18": "I-Skills",
    "19": "I-YOE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-COL": 0,
    "B-CWA": 1,
    "B-Degree": 2,
    "B-Des": 3,
    "B-Email": 4,
    "B-GYear": 5,
    "B-LOC": 6,
    "B-Name": 7,
    "B-Skills": 8,
    "B-YOE": 9,
    "I-COL": 10,
    "I-CWA": 11,
    "I-Degree": 12,
    "I-Des": 13,
    "I-Email": 14,
    "I-GYear": 15,
    "I-LOC": 16,
    "I-Name": 17,
    "I-Skills": 18,
    "I-YOE": 19
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
